In [ ]:
# Adiba Mohammed
# 12/6/2021
# 17.1 textbook exercise
# books sql

In [7]:
import sqlite3

In [8]:
connection = sqlite3.connect('books.db')

In [3]:
import pandas as pd

In [4]:
pd.options.display.max_columns = 10

In [9]:
# a
pd.read_sql("""SELECT last FROM authors

ORDER BY last DESC""", connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

In [10]:
# b
pd.read_sql("""SELECT title FROM titles
ORDER BY title ASC""", connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [ ]:
# c
pd.read_sql("""SELECT first, last, title

FROM authors INNER JOIN author ON authors.id = author.id
INNER JOIN books ON title_id=books.title_id
GROUP BY last, title, copyright, authors_ISBN.ISBN
ORDER BY authors.title""",connection)

In [12]:
# d
cursor=connection.cursor()

In [14]:
# d
cursor = cursor.execute("""INSERT INTO authors (first, last) VALUES ('Bob', 'Henry')""")

In [15]:
# d
pd.read_sql('SELECT id, first, last FROM authors',
           connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Bob   Henry
7         Bob   Henry

In [ ]:
# e
pd.read_sql("""INSERT INTO author_ISBN, titles( author_ISBN.id, author_ISBN.isbn, 
                               titles.ISBN, titles.title, titles.edition, titles.copyright) VALUES ( 8, 31-25489, 22-54879, 'Survey of Python', 1, 2021)""")